#include <iostream>
using namespace std;

int main() {
    // Оголошуємо змінні для введення значень
    int a, b, c, d;
    
    // Введення значень для a, b, c та d
    cout << "Введіть значення a: ";
    cin >> a;
    
    cout << "Введіть значення b: ";
    cin >> b;
    
    cout << "Введіть значення c: ";
    cin >> c;
    
    cout << "Введіть значення d: ";
    cin >> d;

    // Обчислення виразу з побітовими операціями
    int result = ((b << 5) + b) + (((d << 4) - d + ((a << 3) + (a << 2))) >> 9) - ((c << 6) + (c << 1)) + ((d << 4) - (d << 1));

    // Виведення результату
    cout << "Результат виразу: " << result << endl;

    return 0;
}
